const myRecipes = [
    {
        id: 1,
        title: 'Хрустящий картофель с чесноком',
        category: 'Гарниры',
        time: 50,
        kcal: 280,
        image: 'https://images.unsplash.com/photo-1518013031636-a184b0c6d1ee?w=500',
        ingredients: ['Картофель 800г', 'Масло 3 ст.л.', 'Чеснок', 'Специи'],
        steps: ['Нарезать дольками.', 'Смешать со специями.', 'Запекать 40 мин при 200°C.']
    },
    {
        id: 2,
        title: 'Скандинавские тосты',
        category: 'Завтрак',
        time: 15,
        kcal: 320,
        image: 'https://images.unsplash.com/photo-1525351484163-7529414344d8?w=500',
        ingredients: ['Хлеб', 'Авокадо', 'Семга'],
        steps: ['Поджарьте хлеб.', 'Намажьте авокадо.', 'Выложите рыбу.']
    },
    {
        id: 4,
        title: 'Маковые рулеты с творогом (4 рулета)',
        category: 'Выпечка',
        time: 150,
        kcal: 420,
        image: 'https://i.ibb.co/m568f6S/image.jpg', // Твое красивое фото из ТГ
        video: 'https://t.me/nasti_kitchen/409', // Твоя ссылка на видео
        ingredients: [
            'Тесто: Мука — 700 г', 'Тёплое молоко — 250 мл', 'Дрожжи — 11 г', 'Сахар — 100 г',
            'Яйца — 2 шт.', 'Сливочное масло — 120 г', 'Ванильный сахар — 1 ст. л.',
            'Маковая начинка: Мак — 220 г', 'Сгущёнка — 370 г', 'Молоко — 100 мл',
            'Творожная начинка: Творог — 380 г', 'Желтки — 2 шт.', 'Корица — 1 ч. л.'
        ],
        steps: [
            '1. Тесто. В миске объединяем тёплое молоко, дрожжи, сахар, яйца, соль и ванильный сахар. Перемешиваем. Добавляем муку и замешиваем 2 минуты. Затем вводим мягкое сливочное масло и вымешиваем ещё 7–8 минут до мягкого, эластичного теста. Оставляем в тепле на 2 часа.',
            '2. Маковая начинка. В сотейник выливаем сгущёнку, добавляем мак и 100 мл молока. Готовим до загустения. В конце добавляем масло и даём остыть.',
            '3. Творожная начинка. Творог соединяем с желтками, сахаром, ванилью и корицей. Перемешиваем до кремовой массы.',
            '4. Формирование рулетов. Тесто делим на 4 части, раскатываем. Выкладываем сначала творог, затем мак. Сворачиваем, разрезаем вдоль не до конца и плетем косичку. В форму 15,5 см.',
            '5. Выпекаем. Ставим воду в духовку для мягкости. Выпекаем при 180°C около 35 минут. Горячие рулеты смазываем мёдом.'
        ]
    }
];
